doc/BUILD/source/_static/soap_outputs/6.2.314.3321/create_question_from_json_step_5_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <question>
          <hidden_flag>0</hidden_flag>
          <skip_lock_flag>0</skip_lock_flag>
          <query_text>Get number of machines</query_text>
          <expire_seconds>0</expire_seconds>
          <force_computer_id_flag>0</force_computer_id_flag>
          <action_tracking_flag>0</action_tracking_flag>
          <expiration>2015-08-07T11:54:41</expiration>
          <context_group>
            <id>0</id>
          </context_group>
          <user>
            <name>Jim Olsen</name>
            <id>1</id>
          </user>
          <management_rights_group>
            <id>0</id>
          </management_rights_group>
          <selects></selects>
          <saved_question>
            <id>0</id>
          </saved_question>
        </question>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>